Revit 2027 API
BuiltInFailures.SweepFailures.SweepFailedError Property
 Proper sweep geometry creation failed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SweepFailedError { get; }
Public Shared ReadOnly Property SweepFailedError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SweepFailedError {
	FailureDefinitionId^ get ();
}
static member SweepFailedError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SweepFailures Class
Autodesk.Revit.DB Namespace